/* Error string for OTR message string */
"A private conversation could not be set up." = "Não foi possível configurar uma conversação privada .";

/* Title for the about page */
"About" = "Sobre";

/* Label for button to show version numbers and licenses */
"About This Version" = "Sobre esta Versão";

/* SSL error message */
"Access denied" = "Acesso negado";

/* The string describing a buddy's account */
"Account" = "Conta";

/* Title for the accounts tab */
"Accounts" = "Contas";

/* Button title to add someone as a buddy */
"Add" = "Adicionar";

/* The title for the view to add a buddy */
"Add Buddy" = "Adicionar Contacto";

/* Label for button to create account by logging into an existing account */
"Add Existing Account" = "Add Existing Account";

/* String to describe advanced set of settings */
"Advanced" = "Avançado";

/* No comment provided by engineer. */
"Advanced Encryption Settings" = "Advanced Encryption Settings";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "Ocorreu um erro enquanto encriptava uma mensagem e esta não foi enviada.";

/* SSL error message */
"Attempt to restore an unknown session" = "Tentativa de restaurar uma sessão desconhecida";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "Auto-eliminar";

/* Label in buddy list for users that are available */
"Available" = "Disponível";

/* Label in buddy list for users that are away */
"Away" = "Ausente";

/* SSL error message */
"Bad certificate format" = "Mau formato de certificado";

/* SSL error message */
"Bad MAC" = "Mau MAC";

/* SSL error message */
"Bad protocol version" = "Má versão do protocolo";

/* SSL error message */
"Bad SSLCipherSuite" = "Má SSLCipherSuite";

/* SSL error message */
"Bad unsupported cert format" = "Mau formato de certificado não-suportado";

/* string to describe basic set of settings */
"Basic" = "Básico";

/* username section */
"Basic Setup" = "Basic Setup";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords.";

/* No comment provided by engineer. */
"Best Available" = "Best Available";

/* The String for a button to block a buddy */
"Block" = "Bloquear";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "Bloquear & Remover";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "Informação do Contacto";

/* Cancel an alert window */
"Cancel" = "Cancelar";

/* Error string for OTR message string */
"Cannot read the received message." = "Não é possível ler a mensagem recebida.";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "Não é possível reconhecer o tipo de mensagem OTR recevida.";

/* SSL error message */
"Cert chain not verified by root" = "A corrente de certificados não foi verificada por root";

/* SSL error message */
"Certificate expired" = "O certificado expirou";

/* SSL error message */
"Certificate revoked" = "O certificado foi revogado";

/* SSL error message */
"Chain had a cert not yet valid" = "A corrente tinha um certificado que ainda não é válido";

/* SSL error message */
"Chain had an expired cert" = "A corrente tinha um certificado expirado";

/* Title for chat view */
"Chat" = "Conversa";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "Converse comigo em segurança";

/* Title for chats view */
"Chats" = "Conversações";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure Push";

/* let users know source is on Github */
"Check out the source here on Github" = "Verifique o código fonte aqui no Github";

/* server selection footer */
"Choose from our list of trusted servers, or use your own." = "Choose from our list of trusted servers, or use your own.";

/* title for server selection screen */
"Choose Server" = "Choose Server";

/* SSL error message */
"Cipher Suite negotiation failure" = "Erro de negociação da Cipher Suite";

/* Label for text field where you compose a new message */
"Compose" = "Compor";

/* SSL error message */
"Configuration error" = "Erro de configuração";

/* String for button to connect connect */
"Connect" = "Connect";

/* Whether or not account is logged in */
"Connected" = "Ligado";

/* String to state if an account is progress of creating a connection */
"Connecting" = "A ligar";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "A ligar ao Tor";

/* SSL error message */
"Connection closed gracefully" = "Ligação terminada graciosamente";

/* SSL error message */
"Connection closed via error" = "Ligação terminada por erro";

/* Copy string to clipboard as in copy and paste */
"Copy" = "Copiar";

/* No comment provided by engineer. */
"Could not decrypt database. If the app is not working properly, you may need to delete and reinstall." = "Could not decrypt database. If the app is not working properly, you may need to delete and reinstall.";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "Could not retrieve public key from certificate";

/* No comment provided by engineer. */
"Crash Detected" = "Crash Detected";

/* Title for button to create account */
"Create" = "Criar";

/* Label for button to create a new account via in band registration */
"Create New Account" = "Criar  Nova Conta";

/* Start of sentence that will be followed by names */
"Created by" = "Criado por";

/* Title for progress of creating a new account */
"Creating Account" = "Criação de Conta";

/* Place holder label for custom domains */
"Custom" = "Custom";

/* if you want to change your username */
"Customize Username" = "Customize Username";

/* No comment provided by engineer. */
"Database Error" = "Database Error";

/* SSL error message */
"Decoding error" = "Erro de descodificação";

/* SSL error message */
"Decompression failure" = "Falha de descompressão";

/* SSL error message */
"Decryption error" = "Erro de desencriptação";

/* SSL error message */
"Decryption failed" = "Desencriptação falhou";

/* SSL error message */
"Decryption failure" = "Falha de desencriptação";

/* default string to revert to normal language behaviour */
"Default" = "Definição Padrão";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "Eliminar a conta?";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "Eliminar conversas ao desligar";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "Entregue";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "Não Perturbar";

/* No comment provided by engineer. */
"Don't change these unless you really know what you're doing. By default we will always select the best available encryption method." = "Don't change these unless you really know what you're doing. By default we will always select the best available encryption method.";

/* Title for donation link */
"Donate" = "Doar";

/* Title for button to press when user is finished */
"Done" = "Terminado";

/* The string describing account name or email address for a buddy */
"Email" = "E-mail";

/* enable permission */
"Enable" = "Enable";

/* button for enabling push messages */
"Enable Push" = "Enable Push";

/* button for enabling push messages in iOS system settings */
"Enable Push in Settings" = "Enable Push in Settings";

/* No comment provided by engineer. */
"Enable Tor" = "Enable Tor";

/* Generic title for encryption errors */
"Encryption Error" = "Erro de Encriptação";

/* The placeholder text for the text field to enter a group chat name or label */
"Enter a group name" = "Enter a group name";

/* Title of error message pop-up box */
"Error" = "Error";

/* title label for error when creating account */
"Error Creating Account" = "Erro de Criação de Conta";

/* SSL error message */
"Export restriction" = "Restrição de exportação";

/* Default message when a user status is set to extended away */
"Extended Away" = "Ausência Prolongada";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "Não foi possível ligar ao servidor XMPP. Por favor, verifique as suas credenciais de sessão e de ligação à Internet e tente novamente.";

/* SSL error message */
"Fatal alert" = "Alerta fatal";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "Esqueceu-se da frase de palavra-passe?";

/* whether or not we should generate a strong password for them */
"Generate Secure Password" = "Generate Secure Password";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* a subtitle label for a group chat */
"Group Chat" = "Group Chat";

/* The title for the view to enter a group chat name or label */
"Group Name" = "Group Name";

/* SSL error message */
"Handshake failure" = "Falha no aperto de mãos";

/* Label for button to open link to translate app */
"Help Translate" = "Ajude a Traduzir";

/* Label for button to hold to record audio */
"Hold to talk" = "Hold to talk";

/* Label text for hostname field on login scree */
"Hostname" = "NNome de Hospedeiro";

/* SSL error message */
"I/O would block (not fatal)" = "I/O poderá bloquear (não fatal)";

/* SSL error message */
"Illegal parameter" = "Parâmetro ilegal";

/* Label for incoming data transfers */
"Incoming" = "Incoming";

/* Short for information, button title to get more information */
"Info" = "Informação";

/* SSL error message */
"Insufficient buffer provided" = "O buffer fornecido é insuficiente";

/* SSL error message */
"Insufficient security" = "Segurança insuficiente";

/* SSL error message */
"Internal error" = "Erro interno";

/* SSL error message */
"Invalid certificate chain" = "Cadeia de certificados inválida";

/* title label for invalid email */
"Invalid Email" = "E-mail Inválido";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Jabber (XMPP)";

/* Label for button after to send push notification knock. Like knocking on a door */
"Knock" = "Knock";

/* Text for label after knock is sent. Like knocking on a door */
"Knock Sent" = "Knock Sent";

/* string to bring up language selector */
"Language" = "Idioma";

/* log in to account */
"Log In" = "Iniciar Sessão";

/* log out from account */
"Log Out" = "Terminar Sessão";

/* Label for account setting that autologins on launch */
"Login Automatically" = "Iniciar Sessão Automaticamente";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "Manage ChatSecure Push account";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "Gerir certificados SSL guardados";

/* No comment provided by engineer. */
"Me" = "Me";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it.";

/* microphone permission is disabled */
"Microphone Disabled" = "Microphone Disabled";

/* SSL error message */
"Miscellaneous bad certificate" = "Mau certificado";

/* SSL error message */
"Module attach failure" = "Falha da anexação do módulo";

/* Your QR code */
"My QR Code" = "My QR Code";

/* The string describing a buddy's display name */
"Name" = "Nome";

/* For a new settings value */
"New" = "Novo";

/* Title for New Account View */
"New Account" = "Nova Conta";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "Novo Certificado SSL";

/* Label for button to go to next step */
"Next" = "Next";

/* for choosing your XMPP vCard display name */
"Nickname" = "Nickname";

/* SSL error message */
"No Error" = "Nenhum Erro";

/* SSL error message */
"No renegotiation allowed" = "Não é permitido renegociar";

/* Label in buddy list for users that are offline */
"Offline" = "Offline";

/* Accept the dialog */
"OK" = "OK";

/* For an old settings value */
"Old" = "Velho";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "Open in Chrome";

/* Label for button to open link in facebook app */
"Open in Facebook" = "Open in Facebook";

/* Label for button to open link in twitter app */
"Open in Twitter" = "Open in Twitter";

/* Hint text for domain field telling user this field is not required */
"Optional" = "Opcional";

/* Title for other miscellaneous settings group */
"Other" = "Outros";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "Our policy requires encryption but we are trying to send an unencrypted message out.";

/* Label text for password field on login screen */
"Password" = "Palavra-passe";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "O certificado do par é válido, ou foi ignorado se a verificação estiver desligada";

/* SSL error message */
"Peer dropped connection before responding" = "O par perdeu a ligação antes de responder";

/* SSL error message */
"Peer host name mismatch" = "Hostname do par não corresponde";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "Aguardando Aprovação";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "Eliminar permanentemente";

/* Label for button to open up photo library and choose photo */
"Photo Library" = "Photo Library";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "Certificados Fixados";

/* Label for messages that are not encrypted */
"plaintext" = "plaintext";

/* No comment provided by engineer. */
"Plaintext (Opportunistic OTR)" = "Plaintext (Opportunistic OTR)";

/* No comment provided by engineer. */
"Plaintext Only" = "Plaintext Only";

/* detail title label for invalid email */
"Please choose a valid email address" = "Please choose a valid email address";

/* Label for port number field for connecting to service */
"Port" = "Porta";

/* title for contacts profile view */
"Profile" = "Profile";

/* Title for push-messaging related settings */
"Push" = "Push";

/* Label for qr code image */
"QR code" = "QR code";

/* Error string for OTR message string */
"Received a general OTR error." = "Received a general OTR error.";

/* Error string for OTR message string */
"Received a heartbeat." = "Received a heartbeat.";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "Received an encrypted message but cannot read it because no private connection is established yet.";

/* Error string for OTR message string */
"Received an unencrypted message." = "Received an unencrypted message.";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "Received and discarded a message intended for another instance.";

/* Error string for OTR message string */
"Received our own OTR messages." = "Received our own OTR messages.";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "Recentes";

/* SSL error message */
"Record overflow" = "Record overflow";

/* Button title to reject a request such as a buddy request */
"Reject" = "Rejeitar";

/* Label for instruction to delete current recording */
"Release to delete" = "Release to delete";

/* Label for instruction to send current audio */
"Release to send" = "Release to send";

/* Label for switch to save passphrase */
"Remember Passphrase" = "Remember Passphrase";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "Recordar a palavra-passe";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "Remover";

/* No comment provided by engineer. */
"Removed By Server" = "Removed By Server";

/* Reply to an incoming message */
"Reply" = "Responder";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "Requerido";

/* Label for button to resend message. */
"Resend" = "Resend";

/* Ttitle for alert view to resend a message */
"Resend Message" = "Resend Message";

/* Describe what resending will do the %@ will be replaced withe the method OTR/OMEMO/Plaintext */
"Resending this message will use %@." = "Resending this message will use %@.";

/* Label for text input for XMPP resource */
"Resource" = "Resource";

/* Title for button for saving a setting */
"Save" = "Guardar";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "Certificados Guardados";

/* Label for sharing via QR Code */
"Scan QR" = "Scan QR";

/* Label for text field where you search for a buddy */
"Search" = "Search";

/* Title heading in settings */
"Security" = "Segurança";

/* Title of alert box warning about security issues */
"Security Warning" = "Aviso de segurança";

/* The placeholder text in the chat view where the message should go */
"Send %@ encrypted message" = "Send %@ encrypted message";

/* String on button to email feedback */
"Send Feedback" = "Enviar Feedback";

/* The placeholder text in the chat view where the message should go */
"Click here to type something..." = "Click here to type something...";

/* Label text for when a transfer is in progress (normally followed by a percent value 34%) */
"Sending" = "Sending";

/* Error string for OTR message string */
"Sent a heartbeat." = "Sent a heartbeat.";

/* server selection section title */
"Server" = "Server";

/* SSL error message */
"Server closed session with no notification" = "O servidor terminou a sessão sem notificação";

/* SSL error message */
"Server has requested a client cert" = "O servidor pediu um certificado de cliente";

/* Title for the Settings screen */
"Settings" = "Definições";

/* Title for sharing a link to the app */
"Share" = "Partilhar";

/* Label for inviting friends via URL */
"Share Invite" = "Share Invite";

/* No comment provided by engineer. */
"Show Advanced Encryption Settings" = "Show Advanced Encryption Settings";

/* toggle switch for show advanced */
"Show Advanced Options" = "Show Advanced Options";

/* title label for signing up for a new account */
"Sign Up" = "Sign Up";

/* Label for button to skip this step */
"Skip" = "Skip";

/* A placeholder for a buddy's username like Someone wants to chat. */
"Someone" = "Someone";

/* SSL error message */
"SSL protocol error" = "Erro de protocolo SSL";

/* Label for button to take a photo from camera */
"Take Photo" = "Take Photo";

/* No comment provided by engineer. */
"The app crashed last time it was launched. Send a crash report?" = "The app crashed last time it was launched. Send a crash report?";

/* Error string for OTR message string */
"The message received contains malformed data." = "The message received contains malformed data.";

/* Error string for OTR message string */
"The previous message was resent." = "The previous message was resent.";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "The XMPP server does not support in-band registration";

/* basic setup selection footer */
"Think of a unique nickname that you don't use anywhere else and doesn't contain personal information." = "Think of a unique nickname that you don't use anywhere else and doesn't contain personal information.";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "This device doesn't seem to be configured to make payments.";

/* Error message description */
"This message was received from an untrusted device." = "This message was received from an untrusted device.";

/* Error message description */
"This message was sent to an untrusted device." = "This message was sent to an untrusted device.";

/* microphone permission is disabled */
"To use this feature you must re-enable microphone permissions." = "To use this feature you must re-enable microphone permissions.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "Tor is an experimental feature, please use with caution.";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* Title for error message */
"Unable to Send Message" = "Unable to Send Message";

/* SSL error message */
"Underlying cryptographic error" = "Erro criptográfico adjacente ";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "Registo inesperado (ignorado) em DTLS";

/* SSL error message */
"Unexpected message received" = "Mensagem não esperada recebida";

/* SSL error message */
"Unknown Cert Authority" = "Autoridade Emissora do Certificado Desconhecida";

/* SSL error message */
"Unknown certificate" = "Certificado desconhecido";

/* Describes an error without a known cause */
"Unknown Error" = "Unknown Error";

/* Label for button to unlock app */
"Unlock" = "Unlock";

/* shown when invite QR code doesnt work */
"Unrecognized Invite Format" = "Unrecognized Invite Format";

/* Title for error message */
"Untrusted Device" = "Untrusted Device";

/* SSL error message */
"User canceled" = "O utilizador cancelou";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "Nome de utilizador";

/* SSL error message */
"Valid cert chain, untrusted root" = "Corrente de certificados válida, origem não confiável";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "Certificado válido";

/* To let the user know the fingerprint as been checked */
"Verified" = "Verificado";

/* Shown when verifying fingerprints */
"Verify" = "Verificar";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "Verificar Fingerprint";

/* when displaying version numbers such as 1.0.0 */
"Version" = "Versão";

/* The label for a button to view the buddy profile */
"View Profile" = "View Profile";

/* Describe how to change a contact's device settings */
"View profile to review contact's devices or change encryption settings." = "View profile to review contact's devices or change encryption settings.";

/* Label text for when a transfer has not started yet */
"Waiting" = "Waiting";

/* This string follows a user's dislplay name or username ex Bob wants to chat. */
"wants to chat." = "wants to chat.";

/* help text for password generator */
"We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else." = "We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this account." = "We could not find any trusted devices for this account.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this contact." = "We could not find any trusted devices for this contact.";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "Would you like to connect to UserVoice to send feedback?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* String used when onboarding works */
"You're ready to use" = "You're ready to use";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "A sua doação irá contribuir para o desenvolvimento continuado do ChatSecure.";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history.";

